src/cf/Documents/ПодтверждениеНулевойСтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПодтверждениеНулевойСтавкиНДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.НДСРеализация0</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленныйРеализация0</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяПрочихРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦенности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Покупатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОтгрузки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СобытияПоНДСПродажи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродажиСНДС0</Name>
							<Comment>Сумма продаж, по которым применяется ставка НДС 0%</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсоваяРазница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФактураВыданный</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодыОперацийПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтредактированыСтрокиКодовОпераций</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыОперацийНалоговаяБаза</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НесырьевыеТовары</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродажиСНДС0</Name>
							<Comment>Сумма продаж, по которым применяется ставка НДС 0%</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/НДСРеализация0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НДСРеализация0</Name>
			<Comment>НДС по реализации 0%</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсоваяРазница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияПоНДСПродажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДССостоянияРеализация0</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Comment>Счет-фактура (документ реализации)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаВА</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемИПередачаВРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеНулевойСтавкиНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/СобытияПоНДСПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СобытияПоНДСПродажи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолученАванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСНачисленКУплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвержденаСтавка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодтвержденаСтавка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДССкорректирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогИсчисляетПокупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеНДС0</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийСчетФактура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСчетФактура</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммовыеРазницы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаАвансКомитента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаАванса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводнаяСправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочнаяСправка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ПодтверждениеНулевойСтавкиНДС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ПодчиненныеСчетаФактуры; // таблица счетов-фактур, основанием которых является этот документ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Очистим движения	
	Движения.НДСРеализация0.Записывать = Истина;
	Движения.НДСРеализация0.Очистить();
	Движения.НДСРеализация0.Записать();

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	// Подготовка наборов записей.
	ПроведениеДокументовУНФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	КлассифицироватьНоменклатуруПоОперациям0 = УчетНДСВызовСервера.КлассифицироватьНоменклатуруПоОперациям0(Дата, Организация);
	
	ПараметрыПроведения = Документы.ПодтверждениеНулевойСтавкиНДС.ПодготовитьПараметрыПроведения(Ссылка,
		КлассифицироватьНоменклатуруПоОперациям0, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИБ

	СтруктураТаблицСтавкаПодтверждена = УчетНДС.ПодготовитьТаблицуНДСПредъявленныйРеализация0СнятиеБлокировкиВычета(
		ПараметрыПроведения.ТаблицаРеквизиты,
		ПараметрыПроведения.ТаблицаСтавкаПодтверждена, Движения);

	ТаблицаСтавкаПодтвержденаСнятиеБлокировкиВычета = СтруктураТаблицСтавкаПодтверждена.НДСПредъявленныйРеализация0СнятиеБлокировкиВычета;
	ТаблицаСтавкаПодтвержденаРеализация0 = СтруктураТаблицСтавкаПодтверждена.ТаблицаРеализация0;
		
	СтруктураТаблицСтавкаНеПодтверждена = УчетНДС.ПодготовитьТаблицуНДСПредъявленныйРеализация0СнятиеБлокировкиВычета(
		ПараметрыПроведения.ТаблицаРеквизиты,
		ПараметрыПроведения.ТаблицаСтавкаНеПодтверждена, Движения);
		
	ТаблицаСтавкаНеПодтвержденаСнятиеБлокировкиВычета = СтруктураТаблицСтавкаНеПодтверждена.НДСПредъявленныйРеализация0СнятиеБлокировкиВычета;
	ТаблицаСтавкаНеПодтвержденаРеализация0 = СтруктураТаблицСтавкаНеПодтверждена.ТаблицаРеализация0;

	ТаблицаНДСНачисленныйСторно = Новый ТаблицаЗначений;

	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ

	УчетНДС.СформироватьДвиженияСтавка0Подтверждена(
		ПараметрыПроведения.ТаблицаРеквизиты,
		ПараметрыПроведения.ТаблицаСтавкаПодтверждена,
		ПараметрыПроведения.ТаблицаСтавкаПодтвержденаРеализация0,
		ТаблицаСтавкаПодтвержденаСнятиеБлокировкиВычета,
		ТаблицаСтавкаПодтвержденаРеализация0,
		Движения, Отказ);

	УчетНДС.СформироватьДвиженияСтавка0НеПодтверждена(
		ПараметрыПроведения.ТаблицаРеквизиты,
		ПараметрыПроведения.ТаблицаСтавкаНеПодтверждена,
		ПараметрыПроведения.ТаблицаСтавкаНеПодтвержденаРеализация0,
		ТаблицаСтавкаНеПодтвержденаСнятиеБлокировкиВычета,
		ТаблицаНДСНачисленныйСторно,
		ТаблицаСтавкаНеПодтвержденаРеализация0,
		Движения, Отказ);
		
	Если НЕ Отказ И Движения.НДСЗаписиКнигиПродаж.Количество() > 0 Тогда
		Движения.НДСЗаписиКнигиПродаж.Записать(Истина);
		Движения.НДСЗаписиКнигиПродаж.Записывать = Ложь;
		ДополнитьДвиженияНДСДокументамиОплаты(Отказ);
	КонецЕсли;
		
	Движения.Записать();
	
	ОбновитьСчетаФактуры(РежимЗаписиДокумента.Проведение);

КонецПроцедуры

Процедура ДополнитьДвиженияНДСДокументамиОплаты(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактураДокумент,
	|	ПодтверждениеНулевойСтавкиНДССостав.ДокументОтгрузки КАК ДокументОтгрузки
	|ПОМЕСТИТЬ СчетаФактурыПоДокументамОтгрузки
	|ИЗ
	|	Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК ПодтверждениеНулевойСтавкиНДССостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ПодтверждениеНулевойСтавкиНДССостав.ДокументОтгрузки = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	ПодтверждениеНулевойСтавкиНДССостав.Ссылка = &Ссылка
	|	И ПодтверждениеНулевойСтавкиНДССостав.СчетФактураВыданный = ЗНАЧЕНИЕ(Документ.СчетФактура.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПодтверждениеНулевойСтавкиНДССостав.ДокументОтгрузки,
	|	ПодтверждениеНулевойСтавкиНДССостав.ДокументОтгрузки
	|ИЗ
	|	Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК ПодтверждениеНулевойСтавкиНДССостав
	|ГДЕ
	|	ПодтверждениеНулевойСтавкиНДССостав.Ссылка = &Ссылка
	|	И ПодтверждениеНулевойСтавкиНДССостав.ДокументОтгрузки ССЫЛКА Документ.СчетФактура
	|	И ПодтверждениеНулевойСтавкиНДССостав.СчетФактураВыданный = ЗНАЧЕНИЕ(Документ.СчетФактура.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(НДСЗаписиКнигиПродаж.КодОперации0) КАК КодОперации0,
	|	МАКСИМУМ(НДСЗаписиКнигиПродаж.Период) КАК Период,
	|	МАКСИМУМ(НДСЗаписиКнигиПродаж.Организация) КАК Организация,
	|	МАКСИМУМ(НДСЗаписиКнигиПродаж.Покупатель) КАК Покупатель,
	|	МАКСИМУМ(НДСЗаписиКнигиПродаж.СчетФактура) КАК СчетФактура,
	|	МАКСИМУМ(НДСЗаписиКнигиПродаж.ВидЦенности) КАК ВидЦенности,
	|	МАКСИМУМ(НДСЗаписиКнигиПродаж.СтавкаНДС) КАК СтавкаНДС,
	|	МАКСИМУМ(НДСЗаписиКнигиПродаж.ДатаОплаты) КАК ДатаОплаты,
	|	МАКСИМУМ(НДСЗаписиКнигиПродаж.ДокументОплаты) КАК ДокументОплаты,
	|	МАКСИМУМ(НДСЗаписиКнигиПродаж.Событие) КАК Событие,
	|	МАКСИМУМ(НДСЗаписиКнигиПродаж.ДатаСобытия) КАК ДатаСобытия,
	|	МАКСИМУМ(НДСЗаписиКнигиПродаж.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	|	СчетаФактурыПоДокументамОтгрузкиПредварительная.СчетФактураДокумент КАК СчетФактураДокумент,
	|	МАКСИМУМ(НДСЗаписиКнигиПродаж.ЗаписьДополнительногоЛиста) КАК ЗаписьДополнительногоЛиста,
	|	МАКСИМУМ(НДСЗаписиКнигиПродаж.КорректируемыйПериод) КАК КорректируемыйПериод,
	|	НДСЗаписиКнигиПродаж.СторнирующаяЗаписьДопЛиста КАК СторнирующаяЗаписьДопЛиста,
	|	НДСЗаписиКнигиПродаж.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура
	|ПОМЕСТИТЬ ДвиженияПоСчетамФактурам
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаФактурыПоДокументамОтгрузки КАК СчетаФактурыПоДокументамОтгрузкиПредварительная
	|		ПО НДСЗаписиКнигиПродаж.СчетФактура = СчетаФактурыПоДокументамОтгрузкиПредварительная.ДокументОтгрузки
	|ГДЕ
	|	НДСЗаписиКнигиПродаж.Регистратор = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетаФактурыПоДокументамОтгрузкиПредварительная.СчетФактураДокумент,
	|	НДСЗаписиКнигиПродаж.СторнирующаяЗаписьДопЛиста,
	|	НДСЗаписиКнигиПродаж.ИсправленныйСчетФактура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактураДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияПоСчетамФактурам.КодОперации0 КАК КодОперации0,
	|	ДвиженияПоСчетамФактурам.Период КАК Период,
	|	ДвиженияПоСчетамФактурам.Организация КАК Организация,
	|	ДвиженияПоСчетамФактурам.Покупатель КАК Покупатель,
	|	ДвиженияПоСчетамФактурам.СчетФактура КАК СчетФактура,
	|	ДвиженияПоСчетамФактурам.ВидЦенности КАК ВидЦенности,
	|	ДвиженияПоСчетамФактурам.СтавкаНДС КАК СтавкаНДС,
	|	ДвиженияПоСчетамФактурам.ДатаОплаты КАК ДатаОплаты,
	|	ДвиженияПоСчетамФактурам.ДокументОплаты КАК ДокументОплаты,
	|	ДвиженияПоСчетамФактурам.Событие КАК Событие,
	|	ДвиженияПоСчетамФактурам.ДатаСобытия КАК ДатаСобытия,
	|	ДвиженияПоСчетамФактурам.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерПлатежноРасчетногоДокумента КАК НомерДокументаОплаты,
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаПлатежноРасчетногоДокумента КАК ДатаДокументаОплаты,
	|	ДвиженияПоСчетамФактурам.ЗаписьДополнительногоЛиста КАК ЗаписьДополнительногоЛиста,
	|	ДвиженияПоСчетамФактурам.КорректируемыйПериод КАК КорректируемыйПериод
	|ИЗ
	|	ДвиженияПоСчетамФактурам КАК ДвиженияПоСчетамФактурам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура.ДатаНомерДокументовОплаты КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
	|		ПО ДвиженияПоСчетамФактурам.СчетФактураДокумент = СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка";
	
	ТаблицаНомеровДокументовОплаты = Запрос.Выполнить().Выгрузить();
	УчетНДС.СформироватьДвиженияНДСНомераДокументовОплаты(ТаблицаНомеровДокументовОплаты, Движения, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеДокументовУНФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей.
	ПроведениеДокументовУНФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ОбновитьСчетаФактуры(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	СформироватьСчетаФактуры(Отказ);

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись
		И НЕ РучнаяКорректировка Тогда
		ОбновитьСчетаФактуры(РежимЗаписиДокумента.Запись);
	КонецЕсли; 

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();

	Для каждого СтрокаТЧ Из Состав Цикл
		СтрокаТЧ.СчетФактураВыданный = Документы.СчетФактура.ПустаяСсылка();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ВерсияПостановления1137 = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(Дата);
	
	Если ВерсияПостановления1137 >= 3 Тогда
	
		// Проверим, что в табличной части нет дублей документов отгрузки
		
		ТаблицаСостав = ЭтотОбъект.Состав;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаСостав", ТаблицаСостав);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаСостав.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ТаблицаСостав.Покупатель КАК Покупатель
		|ПОМЕСТИТЬ КоличествоДокументов
		|ИЗ
		|	&ТаблицаСостав КАК ТаблицаСостав
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КОЛИЧЕСТВО(КоличествоДокументов.ДокументОтгрузки) КАК Количество
		|ИЗ
		|	КоличествоДокументов КАК КоличествоДокументов
		|
		|СГРУППИРОВАТЬ ПО
		|	КоличествоДокументов.ДокументОтгрузки,
		|	КоличествоДокументов.Покупатель";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Количество > 1 Тогда
			
				ИмяСписка = НСтр("ru = 'Документы реализации'");
				ТекстСообщенияДублиДокументов = НСтр("ru = 'Соответствие покупателя и документа отгрузки должно быть уникальным.'");
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список", "Корректность",
					, , ИмяСписка, ТекстСообщенияДублиДокументов);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Состав", "Объект", Отказ);
			
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТребуетсяСтатьяПрочихРасходов = Ложь;
	
	// Проверка табличной части
	
	СчетаФактурыВыданные = Новый ТаблицаЗначений;
	
	СчетаФактурыВыданные.Колонки.Добавить("ДокументОтгрузки");
	СчетаФактурыВыданные.Колонки.Добавить("Событие");
	СчетаФактурыВыданные.Колонки.Добавить("ПродажиСНДС0");
	
	КлассифицироватьНоменклатуруПоОперациям0 = УчетНДСВызовСервера.КлассифицироватьНоменклатуруПоОперациям0(Дата, Организация);
	
	Для Каждого СтрокаТаблицы Из Состав Цикл

		Префикс = "Состав[" + (СтрокаТаблицы.НомерСтроки - 1) + "].";
		ИмяСписка = НСтр("ru = 'Документы реализации'");

		Если СтрокаТаблицы.Событие = Перечисления.СобытияПоНДСПродажи.НеПодтвержденаСтавка0
			И НЕ ЗначениеЗаполнено(СтрокаТаблицы.СуммаНДС) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",,
							НСтр("ru = 'Сумма НДС'"),
							СтрокаТаблицы.НомерСтроки, ИмяСписка);
			Поле = Префикс + "СуммаНДС";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
		
		Если КлассифицироватьНоменклатуруПоОперациям0
			И ВерсияПостановления1137 >= 3
			И (СтрНайти(СтрокаТаблицы.КодыОперацийПредставление,"<...>") <> 0
				ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицы.КодыОперацийПредставление)) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",,
							НСтр("ru = 'Коды операций'"),
							СтрокаТаблицы.НомерСтроки, ИмяСписка);
			Поле = Префикс + "КодыОперацийПредставление";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
		
		Если ВерсияПостановления1137 < 3
			И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ВидЦенности) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",,
							НСтр("ru = 'Вид ценности'"),
							СтрокаТаблицы.НомерСтроки, ИмяСписка);
			Поле = Префикс + "ВидЦенности";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
		
		Если СтрокаТаблицы.Событие = Перечисления.СобытияПоНДСПродажи.НеПодтвержденаСтавка0 Тогда
			ТребуетсяСтатьяПрочихРасходов = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Покупатель)
			И ТипЗнч(СтрокаТаблицы.ДокументОтгрузки) <> Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",,
				НСтр("ru = 'Покупатель'"),
				СтрокаТаблицы.НомерСтроки, ИмяСписка);
			Поле = Префикс + "Покупатель";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);

		КонецЕсли;
		
		Если СтрокаТаблицы.Событие = Перечисления.СобытияПоНДСПродажи.НеПодтвержденаСтавка0 
			И ТипЗнч(СтрокаТаблицы.ДокументОтгрузки) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
			Пояснение = НСтр("ru='Неподтверждение нулевой ставки по розничной реализации не поддерживается.'"); 
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
				НСтр("ru = 'Событие'"),
				СтрокаТаблицы.НомерСтроки, ИмяСписка, Пояснение);
			Поле = Префикс + "Событие";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			
		КонецЕсли;
		
		Если ТипЗнч(СтрокаТаблицы.ДокументОтгрузки) = Тип("ДокументСсылка.СчетФактура") Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("ДокументОтгрузки", СтрокаТаблицы.ДокументОтгрузки);
			Отбор.Вставить("Событие", СтрокаТаблицы.Событие);
			НайденныеСтроки = СчетаФактурыВыданные.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокаСчетФактураВыданный = СчетаФактурыВыданные.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСчетФактураВыданный, СтрокаТаблицы);
			Иначе
				НайденныеСтроки[0].ПродажиСНДС0 = НайденныеСтроки[0].ПродажиСНДС0 + СтрокаТаблицы.ПродажиСНДС0;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПроверитьСобытиеСчетовФактурВыданных(СчетаФактурыВыданные, ЭтотОбъект, Отказ);
	
	Если НЕ ТребуетсяСтатьяПрочихРасходов Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяПрочихРасходов");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОбновитьСчетаФактуры(РежимЗаписи)

	Перем РегистрыТребующиеОчисткиПоДокументам;
	
	ДополнительныеСвойства.Свойство("РегистрыТребующиеОчисткиПоДокументам", РегистрыТребующиеОчисткиПоДокументам);
	
	ОтборПоДокументуОснованию = Новый Структура("ДокументОснование", Ссылка);
	Для каждого СтрокаСФ Из ПодчиненныеСчетаФактуры Цикл
		
		СФНеНужен = (ПометкаУдаления Или Не СтрокаСФ.Использован);
		
		Если СФНеНужен И СтрокаСФ.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументСФ = СтрокаСФ.Ссылка.ПолучитьОбъект();
		Если РегистрыТребующиеОчисткиПоДокументам <> Неопределено Тогда
			ДокументСФ.ДополнительныеСвойства.Вставить("РегистрыТребующиеОчисткиПоДокументам",
				РегистрыТребующиеОчисткиПоДокументам);
		КонецЕсли;
		
		Если СФНеНужен И ДокументСФ.ДокументыОснования.Количество() <= 1 Тогда
			ДокументСФ.УстановитьПометкуУдаления(Истина);
			Продолжить;
		КонецЕсли;
		
		Если СФНеНужен Тогда
			
			СтрокиТекОснования = ДокументСФ.ДокументыОснования.НайтиСтроки(ОтборПоДокументуОснованию);
			Для каждого СтрокаТекОснования Из СтрокиТекОснования Цикл
				ДокументСФ.ДокументыОснования.Удалить(СтрокаТекОснования);
			КонецЦикла;
			РежимЗаписиСФ = ?(ДокументСФ.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
			
		Иначе
			
			Если ДокументСФ.ПометкаУдаления Тогда
				ДокументСФ.ПометкаУдаления = Ложь;
			КонецЕсли;
			РежимЗаписиСФ = РежимЗаписи;
			Если ДокументСФ.Проведен И РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
				РежимЗаписиСФ = РежимЗаписиДокумента.ОтменаПроведения;
			ИначеЕсли НЕ ДокументСФ.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				РежимЗаписиСФ = РежимЗаписиДокумента.Проведение;
			КонецЕсли;

		КонецЕсли;
		ДокументСФ.Записать(РежимЗаписиСФ);
	
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьСчетаФактуры(Отказ)
	
	ДанныеСчетовФактур = ДанныеСчетовФактурПоДокументу();
	
	Если ЭтоНовый() Тогда
		ДокументСсылка = ПолучитьСсылкуНового();
		Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
			ДокументСсылка = Документы.ПодтверждениеНулевойСтавкиНДС.ПолучитьСсылку();
			УстановитьСсылкуНового(ДокументСсылка);
		КонецЕсли;
	Иначе
		ДокументСсылка = Ссылка;
	КонецЕсли;
	
	ПодчиненныеСчетаФактуры = НайтиСоздатьПодчиненныеСчетаФактуры(ДокументСсылка, ДанныеСчетовФактур);
	
	ЗаполнитьСчетаФактурыВДокументе();
	
КонецПроцедуры

Функция ДанныеСчетовФактурПоДокументу()

	ДанныеСчетовФактур = ЭтотОбъект.Состав.ВыгрузитьКолонки("Покупатель,ДокументОтгрузки,СчетФактураВыданный,ПродажиСНДС0,СуммаНДС");
	
	НеобходимоСоставитьСчетФактуру = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(Дата) >= 3;
	
	Для каждого СтрокаТабличнойЧасти Из ЭтотОбъект.Состав Цикл
		Если СтрокаТабличнойЧасти.Событие = Перечисления.СобытияПоНДСПродажи.НеПодтвержденаСтавка0
			И НеобходимоСоставитьСчетФактуру Тогда
			НоваяСтрока = ДанныеСчетовФактур.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
		ИначеЕсли ЗначениеЗаполнено(СтрокаТабличнойЧасти.СчетФактураВыданный) Тогда
			СтрокаТабличнойЧасти.СчетФактураВыданный = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеСчетовФактур.Свернуть("Покупатель,ДокументОтгрузки,СчетФактураВыданный", "ПродажиСНДС0,СуммаНДС");
	
	Возврат ДанныеСчетовФактур;

КонецФункции

Функция НайтиСоздатьПодчиненныеСчетаФактуры(ДокументСсылка, ДанныеСчетовФактур)

	ТаблицаПодчиненныеСчетаФактуры = ПолучитьТаблицуПодчиненныхСчетовФактур(ДокументСсылка);
	
	Для каждого СтрокаТаблицы Из ДанныеСчетовФактур Цикл
		
		РанееСозданныйСчетФактура = НайтиСчетФактуруВТаблице(ТаблицаПодчиненныеСчетаФактуры, СтрокаТаблицы);
		
		Если РанееСозданныйСчетФактура = Неопределено Тогда
			
			НовыйСчетФактура = Документы.СчетФактура.СоздатьДокумент();
			
			НовыйСчетФактура.Дата                  = ЭтотОбъект.Дата;
			НовыйСчетФактура.Организация           = ЭтотОбъект.Организация;
			НовыйСчетФактура.Контрагент            = СтрокаТаблицы.Покупатель;
			НовыйСчетФактура.ВидОперации           = Перечисления.ВидыОперацийСчетФактура.Продажа;
			НовыйСчетФактура.КодВидаОперации       = "01";
			НовыйСчетФактура.СуммаДокумента        = СтрокаТаблицы.ПродажиСНДС0;
			НовыйСчетФактура.СуммаНДСДокумента     = СтрокаТаблицы.СуммаНДС;
			НовыйСчетФактура.ВыставленСтатус       = 2;
			НовыйСчетФактура.КодСпособаВыставления = 1;
			НовыйСчетФактура.ДатаВыставления       = ЭтотОбъект.Дата;
			
			Если ТипЗнч(СтрокаТаблицы.ДокументОтгрузки) = Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом") Тогда
				СтруктураСвойств = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.ДокументОтгрузки, "ВалютаДокумента, ДоговорКонтрагента, Контрагент");
				СтруктураСвойств.Вставить("Договор", СтруктураСвойств.ДоговорКонтрагента);
			Иначе
				СтруктураСвойств = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.ДокументОтгрузки, "ВалютаДокумента, Договор, Контрагент");
			КонецЕсли;
			
			НовыйСчетФактура.ВалютаДокумента       = СтруктураСвойств.ВалютаДокумента;
			НовыйСчетФактура.Договор               = СтруктураСвойств.Договор;
			
			НовыйСчетФактура.Комментарий = НСтр("ru = 'Создан автоматически на основании документа подтверждение нулевой ставки НДС'");
			
			НовыйСчетФактура.ДокументыОснования.Добавить().ДокументОснование = ДокументСсылка;
			
			НовыйСчетФактура.ДополнительныеСвойства.Вставить("ОбновлятьРеквизитыПриЗаписи", Ложь);
			Если ДополнительныеСвойства.Свойство("РегистрыТребующиеОчисткиПоДокументам") Тогда
				НовыйСчетФактура.ДополнительныеСвойства.Вставить("РегистрыТребующиеОчисткиПоДокументам",
					ДополнительныеСвойства.РегистрыТребующиеОчисткиПоДокументам);
			КонецЕсли;
			НовыйСчетФактура.Записать();
			
			// Этот новый счет-фактуру нужно зафиксировать в таблице счетов-фактур
			НоваяСтрока = ТаблицаПодчиненныеСчетаФактуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйСчетФактура);
			
			
			Если НЕ ЗначениеЗаполнено(СтруктураСвойств.Договор) Тогда
				
				ТекстСообщения = СтрШаблон(НСтр("ru='В %1 отсутствует договор. Необходимо выбрать договор вручную.'"), НовыйСчетФактура);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект);
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтруктураСвойств.Контрагент) Тогда
				
				ТекстСообщения = СтрШаблон(НСтр("ru='В %1 отсутствует контрагент. Необходимо выбрать контрагента вручную.'"), НовыйСчетФактура);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаПодчиненныеСчетаФактуры;

КонецФункции

Процедура ЗаполнитьСчетаФактурыВДокументе()

	НеобходимоСоставитьСчетФактуру = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(Дата) >= 3;
	
	Для каждого СтрокаТабличнойЧасти Из ЭтотОбъект.Состав Цикл
		Если СтрокаТабличнойЧасти.Событие = Перечисления.СобытияПоНДСПродажи.НеПодтвержденаСтавка0
			И НеобходимоСоставитьСчетФактуру Тогда
			РанееСозданныйСчетФактура = НайтиСчетФактуруВТаблице(ПодчиненныеСчетаФактуры, СтрокаТабличнойЧасти);
			Если РанееСозданныйСчетФактура <> Неопределено Тогда
				СтрокаТабличнойЧасти.СчетФактураВыданный = РанееСозданныйСчетФактура.Ссылка;
				РанееСозданныйСчетФактура.Использован = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуПодчиненныхСчетовФактур(ДокументСсылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактура.Ссылка КАК Ссылка,
	|	СчетФактура.Контрагент КАК Контрагент,
	|	СчетФактура.Договор КАК ДоговорКонтрагента,
	|	СчетФактура.Проведен,
	|	СчетФактура.ПометкаУдаления КАК ПометкаУдаления,
	|	ПодтверждениеНулевойСтавкиНДССостав.ДокументОтгрузки
	|ИЗ
	|	Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК ПодтверждениеНулевойСтавкиНДССостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура КАК СчетФактура
	|		ПО ПодтверждениеНулевойСтавкиНДССостав.СчетФактураВыданный = СчетФактура.Ссылка
	|ГДЕ
	|	ПодтверждениеНулевойСтавкиНДССостав.Ссылка = &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетФактура.Дата,
	|	ПометкаУдаления УБЫВ,
	|	Ссылка";

	ТаблицаПодчиненныеСчетаФактуры = Запрос.Выполнить().Выгрузить();
	ТаблицаПодчиненныеСчетаФактуры.Колонки.Добавить("Использован", Новый ОписаниеТипов("Булево"));
	
	Возврат ТаблицаПодчиненныеСчетаФактуры;

КонецФункции

Функция НайтиСчетФактуруВТаблице(ТаблицаПодчиненныеСчетаФактуры, СтрокаДокумента)
	
	СтруктураПоиска = Новый Структура("Ссылка", СтрокаДокумента.СчетФактураВыданный);
	НайденныеСтроки = ТаблицаПодчиненныеСчетаФактуры.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Если НайденнаяСтрока.Контрагент = СтрокаДокумента.Покупатель ИЛИ НЕ ЗначениеЗаполнено(НайденнаяСтрока.Контрагент) Тогда
			Возврат НайденнаяСтрока;
		КонецЕсли;
	КонецЦикла;

	Для Каждого НайденнаяСтрока Из ТаблицаПодчиненныеСчетаФактуры Цикл
		Если (НайденнаяСтрока.Контрагент = СтрокаДокумента.Покупатель ИЛИ НЕ ЗначениеЗаполнено(НайденнаяСтрока.Контрагент))
			И НайденнаяСтрока.ДокументОтгрузки = СтрокаДокумента.ДокументОтгрузки Тогда
			Возврат НайденнаяСтрока;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции

// Процедура проверят полностью ли подтверждена(не подтвердена) ставки НДС 0% по переданным счетам-фактурам
//
// Параметры:
//   СчетаФактурыВыданные - ТаблицаЗначений - таблица с колонками:
//     * ДокументОтгрузки      - ДокументСсылка.СчетФактураВыданный - счет-фактура, указанный в качестве документа отгрузки.
//     * Событие               - ПеречислениеСсылка.СобытияПоНДСПродажи - событие подтверждения (неподтвердения) ставки НДС 0%.
//       ПродажиСНДС0          - Число (15,2) - сумма без НДС по счету-фактуре табличных частей в новые документы.
//   ЭтотОбъект           - ДанныеФормыСтруктура - объект клиентской формы документа.
//   Отказ                - Булево - Истина, если по счету-фактура частично подтверждена(не подтвердена) ставка НДС 0%.
//
Процедура ПроверитьСобытиеСчетовФактурВыданных(СчетаФактурыВыданные, ЭтотОбъект, Отказ)
	
	НужноПолноеПодтверждениеДокумента = Новый Массив;
	
	// При подтвержение ставки НДС 0% после 180 дней пользователь вручную вводит данные в документ.
	// В этом случае проверка полного подтверждения(неподтвердения) ставки НДС 0% счетам-фактурам
	// не осуществляется, считается, что пользователь сам контролирует вносимые данные.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДСРеализация0Остатки.СчетФактура КАК ДокументОтгрузки,
	|	НДСРеализация0Остатки.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток
	|ИЗ
	|	РегистрНакопления.НДСРеализация0.Остатки(, СчетФактура В (&ДокументыОтгрузки)) КАК НДСРеализация0Остатки";
	
	Запрос.УстановитьПараметр("ДокументыОтгрузки", СчетаФактурыВыданные.ВыгрузитьКолонку("ДокументОтгрузки"));
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("ДокументОтгрузки", Выборка.ДокументОтгрузки);
			
			НайденныеСтроки = СчетаФактурыВыданные.НайтиСтроки(Отбор);
		
			// Запись должна быть единственная, т.к. событие поддерживается только одно событие для
			// счета-фактуры - полное подтверждение, либо не подтверждение ставки НДС 0%.
			
			Если НайденныеСтроки.Количество() = 1 Тогда
				
				Если НайденныеСтроки[0].ПродажиСНДС0 <> Выборка.СуммаБезНДСОстаток Тогда
				
					НужноПолноеПодтверждениеДокумента.Добавить(Выборка.ДокументОтгрузки);
				
				КонецЕсли;
				
			Иначе
				
				НужноПолноеПодтверждениеДокумента.Добавить(Выборка.ДокументОтгрузки);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого Документ Из НужноПолноеПодтверждениеДокумента Цикл
		ТекстСообщения = СтрШаблон(
			НСтр("ru='Для документа %1 доспупно только полное подтверждение, либо неподтверждение нулевой ставки НДС по всем покупателям и кодам операций.'"),
			Документ);
		ИмяСписка = НСтр("ru = 'Документы реализации'");
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список", "Корректность",
						, , ИмяСписка, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Состав", "Объект", Отказ);
		
	КонецЦикла;

КонецПроцедуры

#КонецЕсли
